#### Nama = `Ahmad Hamdani`
#### Nim = `233307092`
#### Kelas = `4D`

1. Melakukan instalasi dan import library yang dibutuhkan seperti numpy dan pandas.

In [85]:
import numpy as np
import pandas as pd
# Menampilkan versi NumPy dan Pandas yang sedang digunakan.
print(f'Versi numpy : {np.__version__}')
print(f'Versi pandas : {pd.__version__}')

Versi numpy : 2.2.3
Versi pandas : 2.2.3

2. Membuat object atau varaiabel untuk wadah suatu data

In [ ]:
# Membuat Pandas Series berisi daftar nilai [0.25, 0.5, 0.75, 1.0].
# Series adalah struktur data 1 dimensi yang mirip dengan array.
data1 = pd.Series([0.25, 0.5, 0.75, 1.0])
data1

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [86]:
# mengambil nilai-nilai dari objek series sebagai array NumPy
data1.values
# fungsi values untuk mengambil nilai-nilai dari objek series dan mengembalikan menjadi array NumPy

array([0.25, 0.5 , 0.75, 1.  ])

In [ ]:
# mangakses nilai di posisi indeks ke-2
data1[2]
# lakukan akses data sesuai dengan indeks, yang dimana indeks biasanya bermula dari

np.float64(0.75)

In [9]:
# mengakses rentang nilai dari posisi indeks ke-1 sampai ke-3
data1[1:3]

1    0.50
2    0.75
dtype: float64

3. Membuat object series baru untuk menampung nilai yang tidak ada (NaN)

In [ ]:
# Membuat Pandas Series berisi daftar nilai yang ada kosongnya
data2 = pd.Series([1, 3, 5, np.nan, 6, 8])
data2

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

4. membuat object series baru, dan memberikan indeks khusus untuk setiap nilai dalam series tersebut.

In [ ]:
# Membuat Series dengan indeks tidak berurutan [2, 5, 3, 7]
data3 = pd.Series([0.25, 0.5, 0.75, 1.0], index=[2, 5, 3, 7])
data3

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

5. Akses nilai dalam objek series dengan indeks = 5

In [ ]:
# mengambil nilai dengan indeks ke 5, jika umumnya berada di indeks ke 1
nilai_5 = data3[5]
nilai_5

np.float64(0.5)

6. Lakukan modifikasi Series dalam series object yang baru

In [ ]:
# Membuat Series dengan indeks string dari ['a', 'b', 'c', 'd']
data4 = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
data4

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [21]:
# memeriksa apakah label 'a' ada di dalam indeks objek series data4
'a' in data4

True

In [22]:
# menambahkan elemen atau nilai baru ke dalam objek series data4
data4['e'] = 1.25
data4

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

7. Menambahkan objek series baru yaitu population, yang dimana kunci dari dictonary tersebut tersebut menjadi indeks dari objek series dan nilai-nilai menjadi objek series

In [87]:
# Membuat Series dari dictionary (key menjadi indeks, value menjadi data).
population_dict = {
  'California' : 38332521, 
  'Texas' : 26448193,
  'New York' : 19651127,
  'Florida' : 19552860,
  'Illinois' : 12882135}

population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

8. Membuat objek dengan struktur 1 dimensi dengan nilai [2, 4, 6]

In [ ]:
pd.Series([2, 4, 6])
"""
Dengan keterangan :
kolom sebelah kiri adalah indeks
kolom sebelah kanan adalah nilai
"""

0    2
1    4
2    6
dtype: int64

9. Membuat ojbjek series baru 'area' yang dimana datanya tak jauh berbeda dari data population

In [ ]:
# Membuat dictionary (key menjadi indeks, value menjadi data).
area_dict = {
  'California' : 423967, 
  'Texas' : 695662,
  'New York' : 141297,
  'Florida' : 170312,
  'Illinois' : 149995}

area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [27]:
# membuat sebuah objek DataFrame dengan menggabungkan 2 objek Series yaitu area dan population
states = pd.DataFrame({'population' : population, 'area' : area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

10. Akses semua indeks yang ada dari objek states yang sudah menampilkan dataframe di atas

In [29]:
index_states = states.index
index_states

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

11. Membuat DataFrame baru yang memiliki ukuran 3x2 atau 3 baris dan 2 kolom yang diisi dengan angka acak

In [ ]:
pd.DataFrame(
  np.random.rand(3, 2),
  columns=['col1', 'col2'],
  index=['row1', 'row2', 'row3']
  )

          col1      col2
row1  0.790843  0.141088
row2  0.752543  0.903578
row3  0.990425  0.774184

12. Slicing & Indexing (loc, iloc)

In [31]:
"""
tambahkan kolom baru dengan nama 'density' ke dalam objek DataFrame states, 
yang merupakan hasil pembagian antara kolom 'population' dan 'area'
"""

states['density'] = states['population'] / states['area']
states

            population    area     density
California    38332521  423967   90.413926
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746
Florida       19552860  170312  114.806121
Illinois      12882135  149995   85.883763

In [33]:
# mengubah urutan DataFrame dengan menukar baris dan kolom (transpose)
states.T

,California,Texas,New York,Florida,Illinois
population,3.833252e+07,2.644819e+07,1.965113e+07,1.955286e+07,1.288214e+07
area,4.239670e+05,6.956620e+05,1.412970e+05,1.703120e+05,1.499950e+05
density,9.041393e+01,3.801874e+01,1.390767e+02,1.148061e+02,8.588376e+01

In [34]:
# akses semua kolom pada setiap baris objek 'area'
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [35]:
"""
iloc untuk indexing berdasarkan posisi (integer location) pada DataFrame states
:3 pada sumbu row untuk memilih baris dari indeks 0 hingga 2 (3 ndak masuk)
:2 pada sumbu column untuk memilih kolom dari indeks 0 hingga 1 (2 tidak masuk)
"""

states.iloc[:3, :2]

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297

In [36]:
"""
loc untuk  melakukan indexing berdasarkan label pada DataFrame states
: 'New York' pada sumbu row untuk memilih baris dari awal  label 'New York'
: 'Pop' pada sumbu column untuk memilih kolom dari awal label 'Population'
"""

states.loc[:'New York', 'population']

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

13. Mengatasi data yang kosong atau NaN

In [39]:
# Mendeteksi data kosong pada data ID
data5 = pd.Series([1, np.nan, 'hello', None])
data5[data5.notnull()]

0        1
2    hello
dtype: object

In [40]:
# atau bisa juga menggunakan perintah: data.isnull()
data5.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [41]:
# membuat DataFrame baru, yang termasuk di dalamnya terdapat nilai yang hilng atau tidak valid dalam data
data6 = pd.DataFrame([[1, np.nan, 2],
                      [2, 3, 5],
                      [np.nan, 4, 6]])
data6

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [42]:
# menghapus baris yang memiliki nilai hilang atau kosong (null)
data6.dropna()

     0    1  2
1  2.0  3.0  5

In [43]:
# menghapus kolom yang memiliki nilai hilang atau kosong (null)
data6.dropna(axis='columns')

   2
0  2
1  5
2  6

In [44]:
# Mengisi nilai kosong dengan nilai 0
data6.fillna(0)

     0    1  2
0  1.0  0.0  2
1  2.0  3.0  5
2  0.0  4.0  6

In [45]:
# mengisi nilai yang kosong dengan nilai sebelumnya
data6.ffill()

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  2.0  4.0  6

In [46]:
# mengisi nilai yang kosong dengan nilai sesudahnya
data6.bfill()

     0    1  2
0  1.0  3.0  2
1  2.0  3.0  5
2  NaN  4.0  6

14. malakukan penggabungan dataframe (concatenation & join)

In [47]:
# menggabungkan dua objek series, yaitu c1 dan c2
c1 = pd.Series([2, 4, 6])
c2 = pd.Series([1, 3, 5])
pd.concat([c1, c2])

0    2
1    4
2    6
0    1
1    3
2    5
dtype: int64

In [48]:
# menggabungkan dengan menghapus indeks yang ada dan set ulang hasilnya
pd.concat([c1, c2], ignore_index=True)

0    2
1    4
2    6
3    1
4    3
5    5
dtype: int64

In [49]:
# Membuat dua objek DataFrame
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({
    'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
    'hire_date': [2004, 2008, 2012, 2014]
})

print("DataFrame df1:")
print(df1)

print("\nDataFrame df2:")
print(df2)

DataFrame df1:
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

DataFrame df2:
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [50]:
# Lakukan one-to-one joins
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [51]:
# menambahkan dataframe df4
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [52]:
# many-to-many joins
df5 = pd.merge(df3, df4)
df5

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [53]:
# menambahkan dataframe df6
df6 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'management']})
df6

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR    management

In [54]:
# many to many join
pd.merge(df1, df5)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

15. Lakukan operasi string

In [60]:
# menambahkan DataFrame df7
data7 = pd.Series([
  'graham chapman', 'John cleese', 'TERRY Gilliam', 'Eric iDLe', 'MICHAEL PALIN'
  ])

data7

0    graham chapman
1       John cleese
2     TERRY Gilliam
3         Eric iDLe
4     MICHAEL PALIN
dtype: object

In [61]:
# lakukan peruahan ke semua huruf dari sebuah string menjadi huruf kecil semua dengan lower()
data7.str.lower()

0    graham chapman
1       john cleese
2     terry gilliam
3         eric idle
4     michael palin
dtype: object

In [62]:
# lakukan pencarian pada setiap elemen yang dimulai dengan karakter 'T'
data7.str.startswith('T')

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [65]:
# lakukan ekstrak kata pertama dari setiap elemen string
data7.str.extract('([A-Za-z]+)', expand=False)

0     graham
1       John
2      TERRY
3       Eric
4    MICHAEL
dtype: object

16. Bekerja dengan dataset berupa file csv dari `titanic.csv`

In [69]:
# lakukan pembacaan file csv
titanic = pd.read_csv('data/04_titanic.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

17. Tampilkan hanya 5 baris pertama pada objek `titanic`

In [71]:
titanic.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

18. Tampilkan hanya 5 baris terakhir pada objek `titanic`

In [72]:
titanic.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

19. Menmpilan informasi-informasi dari DataFrame sebelumnya

In [73]:
# mencari inforamsi dari dataframe
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [74]:
# mencari statistik dari dataframe
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [75]:
# menampilkan jumlah nilai yang hilang (null) dalam setiap kolom
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [76]:
# menghitung jumlah data unik dalam kolom `Survived`
titanic['Survived'].nunique()

2

In [77]:
# melakukan filtering data 'Age' berdasarkan kondisi tertentu
titanic[titanic['Age'] > 50]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
...,...,...,...,...,...,...,...,...,...,...,...,...
820,821,1,1,"Hays, Mrs. Charles Melville (Clara Jennings Gr...",female,52.0,1,1,12749,93.5000,B69,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C

In [78]:
"""
melakukan pengelompokkan data berdasarkan kolom jenis kelamin
dan menghitung total yang selamat untuk setiap jenis kelamin
"""

titanic.groupby('Sex')['Survived'].sum()

Sex
female    233
male      109
Name: Survived, dtype: int64

In [79]:
# lakukan gruping dengan (GroupBy) berdasarkan kolom Sex
# dan menghitung rata-rata selamat untuk setiap jenis kelamin
titanic.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [80]:
"""
lakukan gruping dengan (GroupBy) berdasarkan kolom Sex & Pclass
dan lakukan perhitungan rata-rata selamat untuk setiap jenis kelamin
"""

titanic.groupby(['Sex', 'Pclass'])['Survived'].mean()

Sex     Pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: Survived, dtype: float64

20. Pivot Table

In [82]:
# mengelompokkan data berdasarkan kolom jenis sex & pclass
# dan menghitung rata-rata selamat untuk setiap jenis kelamin
titanic.pivot_table('Survived', index='Sex', columns='Pclass')

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [83]:
# lakukan penambahan variabel range age dengan variabel age
age = pd.cut(titanic['Age'], [0, 18, 80])
titanic.pivot_table('Survived', ['Sex', age], 'Pclass')

C:\Users\ACER\AppData\Local\Temp\ipykernel_680\698366312.py:3: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table('Survived', ['Sex', age], 'Pclass')

Pclass                  1         2         3
Sex    Age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [84]:
# cara lain untuk menggunakan keyword 'aggfunc' untuk menampilkan tambahan informasi
# total survived dan rata-rata harga tiket (fare) per class
titanic.pivot_table(index='Sex', columns='Pclass',
                    aggfunc={'Survived': 'sum', 'Fare': 'mean'})

              Fare                       Survived
Pclass           1          2          3        1   2   3
Sex
female  106.125798  21.970121  16.118810       91  70  72
male     67.226127  19.741782  12.661633       45  17  47